In [1]:
import pandas as pd

In [26]:
df2 = pd.read_csv("../data/stud.csv")

In [29]:
df2

   roll_no    name  maths  physics  chemistry
0        1    Aman     78       65         70
1        2    Riya     88       92         85
2        3    Neha     45       55         50
3        4   Arjun     90       85         88
4        5   Priya     62       58         60
5        6   Rohan     35       40         38
6        7   Kavya     72       75         70
7        8   Sahil     55       60         58
8        9   Meena     80       78         82
9       10  Aditya     92       95         90

In [30]:
df2=df2.assign(total_marks=df2['maths']+df2['physics']+df2['chemistry'])
df2=df2.assign(avg_marks=df2['total_marks']/3)

In [31]:
df2

   roll_no    name  maths  physics  chemistry  total_marks  avg_marks
0        1    Aman     78       65         70          213  71.000000
1        2    Riya     88       92         85          265  88.333333
2        3    Neha     45       55         50          150  50.000000
3        4   Arjun     90       85         88          263  87.666667
4        5   Priya     62       58         60          180  60.000000
5        6   Rohan     35       40         38          113  37.666667
6        7   Kavya     72       75         70          217  72.333333
7        8   Sahil     55       60         58          173  57.666667
8        9   Meena     80       78         82          240  80.000000
9       10  Aditya     92       95         90          277  92.333333